Repository: cscutcher/lia
Catalog: man/*/lia.po
Languages: ru

source: 23 Feb 2018
ru: 23 февраля 2018 г.

source: version 1.0
ru: версия 1.0

source: NAME
ru: ИМЯ

source: lia - LDAP Inventory for Ansible
ru: lia - инвентарь для Ansible из LDAP

source: SYNOPSIS
ru: ОБЗОР

source: B<lia> [B<-h>] (B<--list>|B<--host> I<HOST>)
ru: B<lia> [B<-h>] (B<--list>|B<--host> I<ХОСТ>)

source: DESCRIPTION
ru: ОПИСАНИЕ

source: B<lia> is a helper script to query hosts, groups, and variables from your LDAP server, and provide it to B<ansible>(1). B<lia> is highly configurable to support caching and adjust to any LDAP schema.
ru: B<lia> это вспомогательный скрипт для чтения хостов, групп и переменных с сервера LDAP и предоставления их B<ansible>(1). B<lia> отличается гибкой конфигурацией с поддержкой кэширования и адаптируется к любой схеме LDAP.

source: The program will cache the inventory in JSON format, and serve it until the cache expires.
ru: Программа кэширует инвентарь в формате JSON и читает из кэша, пока он не устареет.

source: OPTIONS
ru: ОПЦИИ

source: Show usage information, and exit.
ru: Показать информацию об использовании и выйти.

source: Print all groups and variables.
ru: Вывести все группы и переменные.

source: B<--host\ >I<HOST>
ru: B<--host\ >I<ХОСТ>

source: Print variables for the host I<HOST>.
ru: Вывести переменные для хоста I<ХОСТ>.

source: EXIT STATUS
ru: ВОЗВРАЩАЕМЫЕ ЗНАЧЕНИЯ

source: Returns zero if the inventory was retrieved.
ru: Возвращает ноль, если инвентарь был прочитан.

source: ENVIRONMENT
ru: ОКРУЖЕНИЕ

source: Sets verbosity of logging sent to standard error. Recognized levels are: B<CRITICAL>, B<ERROR>, B<WARNING> (default), B<INFO>, and B<DEBUG>.
ru: Задаёт уровень журналирования, выводимого в стандартный вывод ошибок. Доступные уровни: B<CRITICAL>, B<ERROR>, B<WARNING> (по умолчанию), B<INFO> и B<DEBUG>.

source: FILES
ru: ФАЙЛЫ

source: Configuration file, see B<lia.json>(5).
ru: Файл настроек, см. B<lia.json>(5).

source: Cached inventory.
ru: Закэшированный инвентарь.

source: CONFORMING TO
ru: СООТВЕТСТВИЕ СТАНДАРТАМ

source: E<.UR http://docs.ansible.com/ansible/latest/dev_guide/developing_inventory.html> Developing Dynamic Inventory Sources E<.UE>
ru: E<.UR http://docs.ansible.com/ansible/latest/dev_guide/developing_inventory.html> Разработка динамических источников инвентаря E<.UE>

source: E<.UR https://specifications.freedesktop.org/basedir-spec/basedir-spec-0.6.html> XDG Base Directory Specification E<.UE>
ru: E<.UR https://specifications.freedesktop.org/basedir-spec/basedir-spec-0.6.html> Спецификация базового каталога XDG E<.UE>

source: SEE ALSO
ru: СМ. ТАКЖЕ

source: lia.json - lia configuration file
ru: lia.json - файл настроек lia

source: The JSON structure in this file defines how B<lia>(1) connects to LDAP server, and what information it searches for.
ru: Структура JSON определяет, как B<lia>(1) подключается к серверу LDAP и какая информация при этом читается.

source: DICTIONARY MEMBERS
ru: КОМПОНЕНТЫ СЛОВАРЯ

source: One or more space-delimited URIs of the LDAP server.
ru: Один или несколько адресов URI, разделённых пробелами, по которым находится сервер LDAP.

source: Optional. Page size to request for search operations.
ru: Необязательный. Размер страницы, запрашиваемый при операциях поиска.

source: Default: 100.
ru: По умолчанию: 100.

source: Optional. Maximum age (in seconds) of the inventory cache at I<$XDG_CACHE_HOME/lia.json> or I<~/.cache/lia.json>.
ru: Необязательный. Максимальное время жизни (в секундах) кэша инвентаря в файле I<$XDG_CACHE_HOME/lia.json> или I<~/.cache/lia.json>.

source: Default: 10800.
ru: По умолчанию: 10800.

source: A dictionary defining how to search for hosts and which attributes to request.
ru: Словарь, определяющий способ поиска хостов, а также запрашиваемые атрибуты.

source: A list of dictionaries, each defining how to search for groups, which attributes to request, and how to interpret host membership.
ru: Массив словарей, каждый из которых определяет способ поиска групп, запрашиваемые атрибуты и способ определения членства в группе.

source: Members of hosts dictionary
ru: Компоненты словаря hosts

source: The node in LDAP, from which the search starts.
ru: Узел в дереве LDAP, с которого начинается поиск.

source: Optional. LDAP search scope, may only be B<sub> for subtree search or any other value for base search. This is a limitation imposed by the ldap3 library abstraction objects.
ru: Необязательный. Область поиска LDAP: допускается либо значение B<sub> для поиска в поддереве (subtree), либо любое другое значение для поиска в основании дерева (base). Это ограничение накладывается абстрактными объектами библиотеки ldap3.

source: Default: B<sub>.
ru: По умолчанию: B<sub>.

source: A list of object class names to search for.
ru: Массив имён классов объектов для поиска.

source: A dictionary describing attributes to request. The following members are required:
ru: Словарь, определяющий запрашиваемые атрибуты. Допускаются следующие компоненты:

source: The attribute containing host name (e.g. "cn").
ru: Атрибут, содержащий имя хоста (напр. "cn").

source: If multiple values are returned for a single object (in other words, a host has multiple names), B<lia> will pick the one in common with the RDN components.
ru: Если для одного объекта найдено несколько значений (иными словами, у хоста несколько имён), то B<lia> выберет то имя, которое присутствует в одном из компонентов RDN.

source: If none of the values are in the RDN, use the first alphabetically.
ru: Если ни одно значение не присутствует в RDN, выбирается первое по алфавиту.

source: For example:
ru: Например:

source: LDAP object:
ru: Объект LDAP:

source: Host name:
ru: Имя хоста:

source: The attribute that holds JSON-formatted variables.
ru: Атрибут, содержащий переменные в формате JSON.

source: Members of each element in groups list
ru: Компоненты каждого словаря в массиве groups

source: Group search criteria. See B<Members of hosts dictionary> above.
ru: Критерии поиска групп. См. B<Компоненты словаря hosts> выше.

source: Identical to the eponymous B<hosts> members, see above.
ru: Аналогично одноимённым компонентам B<hosts>, см. выше.

source: The attribute listing member hosts.
ru: Атрибут, содержащий хосты — члены группы.

source: If B<true>, then the attribute defined in B<host> lists distinguished names of the member hosts. Otherwise, it lists host names.
ru: Если задано значение B<true>, атрибут, указанный в B<host>, содержит уникальные имена (distinguished names) хостов-членов. Иначе он содержит просто имена хостов.

source: EXAMPLE CONFIGURATION
ru: ОБРАЗЕЦ ФАЙЛА НАСТРОЕК
